import React from 'react';
import cardVisaImg from './assets/image 1.png'
import {
    Block, Card, CardIco, CardNumber, Category,
    ContainerHistory, Currency,
    Data, Departament, Divider, Fio,
    Ico, IcoDown, IcoDownStyle, IcoPerson, IcoStyle, IcoUp, Name, Person,
    Ph, Picture, Price, PriceValue, TextBlock, Time,
    TransactionFIRM,
    TransactionItems,
    TrItem
} from "./HistoryTransactionStyle";

export const HistoryTransaction = () => {
    return (
        <ContainerHistory>
            <Ph>
                История последних операций
            </Ph>

            <Block>
                <Data>
                    11.01.2021
                </Data>

                <TransactionItems>
                    <TrItem>
                        <TransactionFIRM>

                            <IcoStyle>
                                <IcoUp/>
                            </IcoStyle>
                            <Picture>
                                <svg width="41" height="40" viewBox="0 0 41 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <circle cx="20.9976" cy="20" r="20" fill="black" fill-opacity="0.25"/>
                                    <path d="M26.2129 19.5693C26.2031 17.9299 26.9546 16.6944 28.4722 15.7834C27.6235 14.5815 26.3393 13.9205 24.6466 13.7931C23.0439 13.6681 21.2904 14.7161 20.6484 14.7161C19.9698 14.7161 18.4182 13.8364 17.1973 13.8364C14.6777 13.8748 12 15.8218 12 19.7832C12 20.9539 12.2165 22.163 12.6494 23.4081C13.2282 25.0475 15.3149 29.0641 17.4916 28.9992C18.6298 28.9728 19.4348 28.2012 20.9159 28.2012C22.3532 28.2012 23.0974 28.9992 24.367 28.9992C26.5631 28.968 28.4504 25.3167 29 23.6725C26.0548 22.3 26.2129 19.6534 26.2129 19.5693V19.5693ZM23.6568 12.2379C24.8898 10.7908 24.778 9.47354 24.7415 9C23.6519 9.0625 22.3921 9.73314 21.6747 10.5576C20.8843 11.4422 20.4197 12.5359 20.5195 13.769C21.6966 13.858 22.7715 13.2594 23.6568 12.2379V12.2379Z" fill="white"/>
                                </svg>


                            </Picture>

                            <TextBlock>
                                <Name>
                                    Apple.com
                                </Name>

                                <Time>
                                    14:53, 11.01.21
                                </Time>
                            </TextBlock>
                        </TransactionFIRM>

                        <Person>
                            <IcoPerson>
                                <svg width="25" height="24" viewBox="0 0 25 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <circle cx="12.7974" cy="12" r="12" fill="#0057FF" fill-opacity="0.1"/>
                                    <path d="M12.5472 6.16602C9.38495 6.16602 6.71387 8.8371 6.71387 11.9993C6.71387 15.1616 9.38495 17.8327 12.5472 17.8327C15.7095 17.8327 18.3805 15.1616 18.3805 11.9993C18.3805 8.8371 15.7095 6.16602 12.5472 6.16602ZM12.5472 9.08268C13.5546 9.08268 14.2972 9.82468 14.2972 10.8327C14.2972 11.8407 13.5546 12.5827 12.5472 12.5827C11.5404 12.5827 10.7972 11.8407 10.7972 10.8327C10.7972 9.82468 11.5404 9.08268 12.5472 9.08268ZM9.5687 14.783C10.092 14.013 10.9646 13.4997 11.9639 13.4997H13.1305C14.1304 13.4997 15.0025 14.013 15.5257 14.783C14.7802 15.581 13.7226 16.0827 12.5472 16.0827C11.3718 16.0827 10.3142 15.581 9.5687 14.783Z" fill="#0057FF"/>
                                </svg>

                            </IcoPerson>

                            <Fio>
                                Иванов И. И.
                            </Fio>
                        </Person>

                        <Departament>
                            Отдел МАРКЕТИНГА
                        </Departament>

                        <Category>
                            ОБОРУДОВАНИЕ
                        </Category>

                        <Card>
                            <CardIco src={cardVisaImg}>
                            </CardIco>
                            <CardNumber>
                                *7640
                            </CardNumber>
                        </Card>

                        <Price>
                            <PriceValue>
                                {(89890).toLocaleString()}
                            </PriceValue>

                            <Currency>
                                RUB
                            </Currency>

                        </Price>

                    </TrItem>
                    <Divider/>

                    <TrItem>
                        <TransactionFIRM>

                            <IcoStyle>
                                <IcoUp/>
                            </IcoStyle>
                            <Picture>
                                <svg width="41" height="40" viewBox="0 0 41 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <circle cx="20.9976" cy="20" r="20" fill="black" fill-opacity="0.25"/>
                                    <path d="M26.2129 19.5693C26.2031 17.9299 26.9546 16.6944 28.4722 15.7834C27.6235 14.5815 26.3393 13.9205 24.6466 13.7931C23.0439 13.6681 21.2904 14.7161 20.6484 14.7161C19.9698 14.7161 18.4182 13.8364 17.1973 13.8364C14.6777 13.8748 12 15.8218 12 19.7832C12 20.9539 12.2165 22.163 12.6494 23.4081C13.2282 25.0475 15.3149 29.0641 17.4916 28.9992C18.6298 28.9728 19.4348 28.2012 20.9159 28.2012C22.3532 28.2012 23.0974 28.9992 24.367 28.9992C26.5631 28.968 28.4504 25.3167 29 23.6725C26.0548 22.3 26.2129 19.6534 26.2129 19.5693V19.5693ZM23.6568 12.2379C24.8898 10.7908 24.778 9.47354 24.7415 9C23.6519 9.0625 22.3921 9.73314 21.6747 10.5576C20.8843 11.4422 20.4197 12.5359 20.5195 13.769C21.6966 13.858 22.7715 13.2594 23.6568 12.2379V12.2379Z" fill="white"/>
                                </svg>


                            </Picture>

                            <TextBlock>
                                <Name>
                                    Apple.com
                                </Name>

                                <Time>
                                    14:53, 11.01.21
                                </Time>
                            </TextBlock>
                        </TransactionFIRM>

                        <Person>
                            <IcoPerson>
                                <svg width="25" height="24" viewBox="0 0 25 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <circle cx="12.7974" cy="12" r="12" fill="#0057FF" fill-opacity="0.1"/>
                                    <path d="M12.5472 6.16602C9.38495 6.16602 6.71387 8.8371 6.71387 11.9993C6.71387 15.1616 9.38495 17.8327 12.5472 17.8327C15.7095 17.8327 18.3805 15.1616 18.3805 11.9993C18.3805 8.8371 15.7095 6.16602 12.5472 6.16602ZM12.5472 9.08268C13.5546 9.08268 14.2972 9.82468 14.2972 10.8327C14.2972 11.8407 13.5546 12.5827 12.5472 12.5827C11.5404 12.5827 10.7972 11.8407 10.7972 10.8327C10.7972 9.82468 11.5404 9.08268 12.5472 9.08268ZM9.5687 14.783C10.092 14.013 10.9646 13.4997 11.9639 13.4997H13.1305C14.1304 13.4997 15.0025 14.013 15.5257 14.783C14.7802 15.581 13.7226 16.0827 12.5472 16.0827C11.3718 16.0827 10.3142 15.581 9.5687 14.783Z" fill="#0057FF"/>
                                </svg>

                            </IcoPerson>

                            <Fio>
                                Иванов И. И.
                            </Fio>
                        </Person>

                        <Departament>
                            Отдел МАРКЕТИНГА
                        </Departament>

                        <Category>
                            ОБОРУДОВАНИЕ
                        </Category>

                        <Card>
                            <CardIco src={cardVisaImg}>
                            </CardIco>
                            <CardNumber>
                                *7640
                            </CardNumber>
                        </Card>

                        <Price>
                            <PriceValue>
                                {(89890).toLocaleString()}
                            </PriceValue>

                            <Currency>
                                RUB
                            </Currency>

                        </Price>

                    </TrItem>
                    <Divider/>

                    <TrItem>
                        <TransactionFIRM>

                            <IcoStyle>
                                <IcoUp/>
                            </IcoStyle>
                            <Picture>
                                <svg width="41" height="40" viewBox="0 0 41 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <circle cx="20.9976" cy="20" r="20" fill="black" fill-opacity="0.25"/>
                                    <path d="M26.2129 19.5693C26.2031 17.9299 26.9546 16.6944 28.4722 15.7834C27.6235 14.5815 26.3393 13.9205 24.6466 13.7931C23.0439 13.6681 21.2904 14.7161 20.6484 14.7161C19.9698 14.7161 18.4182 13.8364 17.1973 13.8364C14.6777 13.8748 12 15.8218 12 19.7832C12 20.9539 12.2165 22.163 12.6494 23.4081C13.2282 25.0475 15.3149 29.0641 17.4916 28.9992C18.6298 28.9728 19.4348 28.2012 20.9159 28.2012C22.3532 28.2012 23.0974 28.9992 24.367 28.9992C26.5631 28.968 28.4504 25.3167 29 23.6725C26.0548 22.3 26.2129 19.6534 26.2129 19.5693V19.5693ZM23.6568 12.2379C24.8898 10.7908 24.778 9.47354 24.7415 9C23.6519 9.0625 22.3921 9.73314 21.6747 10.5576C20.8843 11.4422 20.4197 12.5359 20.5195 13.769C21.6966 13.858 22.7715 13.2594 23.6568 12.2379V12.2379Z" fill="white"/>
                                </svg>


                            </Picture>

                            <TextBlock>
                                <Name>
                                    Apple.com
                                </Name>

                                <Time>
                                    14:53, 11.01.21
                                </Time>
                            </TextBlock>
                        </TransactionFIRM>

                        <Person>
                            <IcoPerson>
                                <svg width="25" height="24" viewBox="0 0 25 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <circle cx="12.7974" cy="12" r="12" fill="#0057FF" fill-opacity="0.1"/>
                                    <path d="M12.5472 6.16602C9.38495 6.16602 6.71387 8.8371 6.71387 11.9993C6.71387 15.1616 9.38495 17.8327 12.5472 17.8327C15.7095 17.8327 18.3805 15.1616 18.3805 11.9993C18.3805 8.8371 15.7095 6.16602 12.5472 6.16602ZM12.5472 9.08268C13.5546 9.08268 14.2972 9.82468 14.2972 10.8327C14.2972 11.8407 13.5546 12.5827 12.5472 12.5827C11.5404 12.5827 10.7972 11.8407 10.7972 10.8327C10.7972 9.82468 11.5404 9.08268 12.5472 9.08268ZM9.5687 14.783C10.092 14.013 10.9646 13.4997 11.9639 13.4997H13.1305C14.1304 13.4997 15.0025 14.013 15.5257 14.783C14.7802 15.581 13.7226 16.0827 12.5472 16.0827C11.3718 16.0827 10.3142 15.581 9.5687 14.783Z" fill="#0057FF"/>
                                </svg>

                            </IcoPerson>

                            <Fio>
                                Иванов И. И.
                            </Fio>
                        </Person>

                        <Departament>
                            Отдел МАРКЕТИНГА
                        </Departament>

                        <Category>
                            ОБОРУДОВАНИЕ
                        </Category>

                        <Card>
                            <CardIco src={cardVisaImg}>
                            </CardIco>
                            <CardNumber>
                                *7640
                            </CardNumber>
                        </Card>

                        <Price>
                            <PriceValue>
                                {(89890).toLocaleString()}
                            </PriceValue>

                            <Currency>
                                RUB
                            </Currency>

                        </Price>

                    </TrItem>
                    <Divider/>

                    <TrItem>
                        <TransactionFIRM>

                            <IcoStyle>
                                <IcoUp/>
                            </IcoStyle>
                            <Picture>
                                <svg width="41" height="40" viewBox="0 0 41 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <circle cx="20.9976" cy="20" r="20" fill="black" fill-opacity="0.25"/>
                                    <path d="M26.2129 19.5693C26.2031 17.9299 26.9546 16.6944 28.4722 15.7834C27.6235 14.5815 26.3393 13.9205 24.6466 13.7931C23.0439 13.6681 21.2904 14.7161 20.6484 14.7161C19.9698 14.7161 18.4182 13.8364 17.1973 13.8364C14.6777 13.8748 12 15.8218 12 19.7832C12 20.9539 12.2165 22.163 12.6494 23.4081C13.2282 25.0475 15.3149 29.0641 17.4916 28.9992C18.6298 28.9728 19.4348 28.2012 20.9159 28.2012C22.3532 28.2012 23.0974 28.9992 24.367 28.9992C26.5631 28.968 28.4504 25.3167 29 23.6725C26.0548 22.3 26.2129 19.6534 26.2129 19.5693V19.5693ZM23.6568 12.2379C24.8898 10.7908 24.778 9.47354 24.7415 9C23.6519 9.0625 22.3921 9.73314 21.6747 10.5576C20.8843 11.4422 20.4197 12.5359 20.5195 13.769C21.6966 13.858 22.7715 13.2594 23.6568 12.2379V12.2379Z" fill="white"/>
                                </svg>


                            </Picture>

                            <TextBlock>
                                <Name>
                                    Apple.com
                                </Name>

                                <Time>
                                    14:53, 11.01.21
                                </Time>
                            </TextBlock>
                        </TransactionFIRM>

                        <Person>
                            <IcoPerson>
                                <svg width="25" height="24" viewBox="0 0 25 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <circle cx="12.7974" cy="12" r="12" fill="#0057FF" fill-opacity="0.1"/>
                                    <path d="M12.5472 6.16602C9.38495 6.16602 6.71387 8.8371 6.71387 11.9993C6.71387 15.1616 9.38495 17.8327 12.5472 17.8327C15.7095 17.8327 18.3805 15.1616 18.3805 11.9993C18.3805 8.8371 15.7095 6.16602 12.5472 6.16602ZM12.5472 9.08268C13.5546 9.08268 14.2972 9.82468 14.2972 10.8327C14.2972 11.8407 13.5546 12.5827 12.5472 12.5827C11.5404 12.5827 10.7972 11.8407 10.7972 10.8327C10.7972 9.82468 11.5404 9.08268 12.5472 9.08268ZM9.5687 14.783C10.092 14.013 10.9646 13.4997 11.9639 13.4997H13.1305C14.1304 13.4997 15.0025 14.013 15.5257 14.783C14.7802 15.581 13.7226 16.0827 12.5472 16.0827C11.3718 16.0827 10.3142 15.581 9.5687 14.783Z" fill="#0057FF"/>
                                </svg>

                            </IcoPerson>

                            <Fio>
                                Иванов И. И.
                            </Fio>
                        </Person>

                        <Departament>
                            Отдел МАРКЕТИНГА
                        </Departament>

                        <Category>
                            ОБОРУДОВАНИЕ
                        </Category>

                        <Card>
                            <CardIco src={cardVisaImg}>
                            </CardIco>
                            <CardNumber>
                                *7640
                            </CardNumber>
                        </Card>

                        <Price>
                            <PriceValue>
                                {(89890).toLocaleString()}
                            </PriceValue>

                            <Currency>
                                RUB
                            </Currency>

                        </Price>

                    </TrItem>
                    <Divider/>

                </TransactionItems>

            </Block>

            <Block>
                <Data>
                    14.01.2021
                </Data>

                <TransactionItems>
                    <TrItem>
                        <TransactionFIRM>

                            <IcoStyle>
                                <IcoUp/>
                            </IcoStyle>
                            <Picture>
                                <svg width="41" height="40" viewBox="0 0 41 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <circle cx="20.9976" cy="20" r="20" fill="black" fill-opacity="0.25"/>
                                    <path d="M26.2129 19.5693C26.2031 17.9299 26.9546 16.6944 28.4722 15.7834C27.6235 14.5815 26.3393 13.9205 24.6466 13.7931C23.0439 13.6681 21.2904 14.7161 20.6484 14.7161C19.9698 14.7161 18.4182 13.8364 17.1973 13.8364C14.6777 13.8748 12 15.8218 12 19.7832C12 20.9539 12.2165 22.163 12.6494 23.4081C13.2282 25.0475 15.3149 29.0641 17.4916 28.9992C18.6298 28.9728 19.4348 28.2012 20.9159 28.2012C22.3532 28.2012 23.0974 28.9992 24.367 28.9992C26.5631 28.968 28.4504 25.3167 29 23.6725C26.0548 22.3 26.2129 19.6534 26.2129 19.5693V19.5693ZM23.6568 12.2379C24.8898 10.7908 24.778 9.47354 24.7415 9C23.6519 9.0625 22.3921 9.73314 21.6747 10.5576C20.8843 11.4422 20.4197 12.5359 20.5195 13.769C21.6966 13.858 22.7715 13.2594 23.6568 12.2379V12.2379Z" fill="white"/>
                                </svg>


                            </Picture>

                            <TextBlock>
                                <Name>
                                    Apple.com
                                </Name>

                                <Time>
                                    14:53, 11.01.21
                                </Time>
                            </TextBlock>
                        </TransactionFIRM>

                        <Person>
                            <IcoPerson>
                                <svg width="25" height="24" viewBox="0 0 25 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <circle cx="12.7974" cy="12" r="12" fill="#0057FF" fill-opacity="0.1"/>
                                    <path d="M12.5472 6.16602C9.38495 6.16602 6.71387 8.8371 6.71387 11.9993C6.71387 15.1616 9.38495 17.8327 12.5472 17.8327C15.7095 17.8327 18.3805 15.1616 18.3805 11.9993C18.3805 8.8371 15.7095 6.16602 12.5472 6.16602ZM12.5472 9.08268C13.5546 9.08268 14.2972 9.82468 14.2972 10.8327C14.2972 11.8407 13.5546 12.5827 12.5472 12.5827C11.5404 12.5827 10.7972 11.8407 10.7972 10.8327C10.7972 9.82468 11.5404 9.08268 12.5472 9.08268ZM9.5687 14.783C10.092 14.013 10.9646 13.4997 11.9639 13.4997H13.1305C14.1304 13.4997 15.0025 14.013 15.5257 14.783C14.7802 15.581 13.7226 16.0827 12.5472 16.0827C11.3718 16.0827 10.3142 15.581 9.5687 14.783Z" fill="#0057FF"/>
                                </svg>

                            </IcoPerson>

                            <Fio>
                                Иванов И. И.
                            </Fio>
                        </Person>

                        <Departament>
                            Отдел МАРКЕТИНГА
                        </Departament>

                        <Category>
                            ОБОРУДОВАНИЕ
                        </Category>

                        <Card>
                            <CardIco src={cardVisaImg}>
                            </CardIco>
                            <CardNumber>
                                *7640
                            </CardNumber>
                        </Card>

                        <Price>
                            <PriceValue>
                                {(89890).toLocaleString()}
                            </PriceValue>

                            <Currency>
                                RUB
                            </Currency>

                        </Price>

                    </TrItem>
                    <Divider/>

                    <TrItem>
                        <TransactionFIRM>

                            <IcoStyle>
                                <IcoUp/>
                            </IcoStyle>
                            <Picture>
                                <svg width="41" height="40" viewBox="0 0 41 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <circle cx="20.9976" cy="20" r="20" fill="black" fill-opacity="0.25"/>
                                    <path d="M26.2129 19.5693C26.2031 17.9299 26.9546 16.6944 28.4722 15.7834C27.6235 14.5815 26.3393 13.9205 24.6466 13.7931C23.0439 13.6681 21.2904 14.7161 20.6484 14.7161C19.9698 14.7161 18.4182 13.8364 17.1973 13.8364C14.6777 13.8748 12 15.8218 12 19.7832C12 20.9539 12.2165 22.163 12.6494 23.4081C13.2282 25.0475 15.3149 29.0641 17.4916 28.9992C18.6298 28.9728 19.4348 28.2012 20.9159 28.2012C22.3532 28.2012 23.0974 28.9992 24.367 28.9992C26.5631 28.968 28.4504 25.3167 29 23.6725C26.0548 22.3 26.2129 19.6534 26.2129 19.5693V19.5693ZM23.6568 12.2379C24.8898 10.7908 24.778 9.47354 24.7415 9C23.6519 9.0625 22.3921 9.73314 21.6747 10.5576C20.8843 11.4422 20.4197 12.5359 20.5195 13.769C21.6966 13.858 22.7715 13.2594 23.6568 12.2379V12.2379Z" fill="white"/>
                                </svg>


                            </Picture>

                            <TextBlock>
                                <Name>
                                    Apple.com
                                </Name>

                                <Time>
                                    14:53, 11.01.21
                                </Time>
                            </TextBlock>
                        </TransactionFIRM>

                        <Person>
                            <IcoPerson>
                                <svg width="25" height="24" viewBox="0 0 25 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <circle cx="12.7974" cy="12" r="12" fill="#0057FF" fill-opacity="0.1"/>
                                    <path d="M12.5472 6.16602C9.38495 6.16602 6.71387 8.8371 6.71387 11.9993C6.71387 15.1616 9.38495 17.8327 12.5472 17.8327C15.7095 17.8327 18.3805 15.1616 18.3805 11.9993C18.3805 8.8371 15.7095 6.16602 12.5472 6.16602ZM12.5472 9.08268C13.5546 9.08268 14.2972 9.82468 14.2972 10.8327C14.2972 11.8407 13.5546 12.5827 12.5472 12.5827C11.5404 12.5827 10.7972 11.8407 10.7972 10.8327C10.7972 9.82468 11.5404 9.08268 12.5472 9.08268ZM9.5687 14.783C10.092 14.013 10.9646 13.4997 11.9639 13.4997H13.1305C14.1304 13.4997 15.0025 14.013 15.5257 14.783C14.7802 15.581 13.7226 16.0827 12.5472 16.0827C11.3718 16.0827 10.3142 15.581 9.5687 14.783Z" fill="#0057FF"/>
                                </svg>

                            </IcoPerson>

                            <Fio>
                                Иванов И. И.
                            </Fio>
                        </Person>

                        <Departament>
                            Отдел МАРКЕТИНГА
                        </Departament>

                        <Category>
                            ОБОРУДОВАНИЕ
                        </Category>

                        <Card>
                            <CardIco src={cardVisaImg}>
                            </CardIco>
                            <CardNumber>
                                *7640
                            </CardNumber>
                        </Card>

                        <Price>
                            <PriceValue>
                                {(89890).toLocaleString()}
                            </PriceValue>

                            <Currency>
                                RUB
                            </Currency>

                        </Price>

                    </TrItem>
                    <Divider/>

                    <TrItem>
                        <TransactionFIRM>

                            <IcoStyle>
                                <IcoUp/>
                            </IcoStyle>
                            <Picture>
                                <svg width="41" height="40" viewBox="0 0 41 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <circle cx="20.9976" cy="20" r="20" fill="black" fill-opacity="0.25"/>
                                    <path d="M26.2129 19.5693C26.2031 17.9299 26.9546 16.6944 28.4722 15.7834C27.6235 14.5815 26.3393 13.9205 24.6466 13.7931C23.0439 13.6681 21.2904 14.7161 20.6484 14.7161C19.9698 14.7161 18.4182 13.8364 17.1973 13.8364C14.6777 13.8748 12 15.8218 12 19.7832C12 20.9539 12.2165 22.163 12.6494 23.4081C13.2282 25.0475 15.3149 29.0641 17.4916 28.9992C18.6298 28.9728 19.4348 28.2012 20.9159 28.2012C22.3532 28.2012 23.0974 28.9992 24.367 28.9992C26.5631 28.968 28.4504 25.3167 29 23.6725C26.0548 22.3 26.2129 19.6534 26.2129 19.5693V19.5693ZM23.6568 12.2379C24.8898 10.7908 24.778 9.47354 24.7415 9C23.6519 9.0625 22.3921 9.73314 21.6747 10.5576C20.8843 11.4422 20.4197 12.5359 20.5195 13.769C21.6966 13.858 22.7715 13.2594 23.6568 12.2379V12.2379Z" fill="white"/>
                                </svg>


                            </Picture>

                            <TextBlock>
                                <Name>
                                    Apple.com
                                </Name>

                                <Time>
                                    14:53, 11.01.21
                                </Time>
                            </TextBlock>
                        </TransactionFIRM>

                        <Person>
                            <IcoPerson>
                                <svg width="25" height="24" viewBox="0 0 25 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <circle cx="12.7974" cy="12" r="12" fill="#0057FF" fill-opacity="0.1"/>
                                    <path d="M12.5472 6.16602C9.38495 6.16602 6.71387 8.8371 6.71387 11.9993C6.71387 15.1616 9.38495 17.8327 12.5472 17.8327C15.7095 17.8327 18.3805 15.1616 18.3805 11.9993C18.3805 8.8371 15.7095 6.16602 12.5472 6.16602ZM12.5472 9.08268C13.5546 9.08268 14.2972 9.82468 14.2972 10.8327C14.2972 11.8407 13.5546 12.5827 12.5472 12.5827C11.5404 12.5827 10.7972 11.8407 10.7972 10.8327C10.7972 9.82468 11.5404 9.08268 12.5472 9.08268ZM9.5687 14.783C10.092 14.013 10.9646 13.4997 11.9639 13.4997H13.1305C14.1304 13.4997 15.0025 14.013 15.5257 14.783C14.7802 15.581 13.7226 16.0827 12.5472 16.0827C11.3718 16.0827 10.3142 15.581 9.5687 14.783Z" fill="#0057FF"/>
                                </svg>

                            </IcoPerson>

                            <Fio>
                                Иванов И. И.
                            </Fio>
                        </Person>

                        <Departament>
                            Отдел МАРКЕТИНГА
                        </Departament>

                        <Category>
                            ОБОРУДОВАНИЕ
                        </Category>

                        <Card>
                            <CardIco src={cardVisaImg}>
                            </CardIco>
                            <CardNumber>
                                *7640
                            </CardNumber>
                        </Card>

                        <Price>
                            <PriceValue>
                                {(89890).toLocaleString()}
                            </PriceValue>

                            <Currency>
                                RUB
                            </Currency>

                        </Price>

                    </TrItem>
                    <Divider/>

                    <TrItem>
                        <TransactionFIRM>

                            <IcoStyle>
                                <IcoUp/>
                            </IcoStyle>
                            <Picture>
                                <svg width="41" height="40" viewBox="0 0 41 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <circle cx="20.9976" cy="20" r="20" fill="black" fill-opacity="0.25"/>
                                    <path d="M26.2129 19.5693C26.2031 17.9299 26.9546 16.6944 28.4722 15.7834C27.6235 14.5815 26.3393 13.9205 24.6466 13.7931C23.0439 13.6681 21.2904 14.7161 20.6484 14.7161C19.9698 14.7161 18.4182 13.8364 17.1973 13.8364C14.6777 13.8748 12 15.8218 12 19.7832C12 20.9539 12.2165 22.163 12.6494 23.4081C13.2282 25.0475 15.3149 29.0641 17.4916 28.9992C18.6298 28.9728 19.4348 28.2012 20.9159 28.2012C22.3532 28.2012 23.0974 28.9992 24.367 28.9992C26.5631 28.968 28.4504 25.3167 29 23.6725C26.0548 22.3 26.2129 19.6534 26.2129 19.5693V19.5693ZM23.6568 12.2379C24.8898 10.7908 24.778 9.47354 24.7415 9C23.6519 9.0625 22.3921 9.73314 21.6747 10.5576C20.8843 11.4422 20.4197 12.5359 20.5195 13.769C21.6966 13.858 22.7715 13.2594 23.6568 12.2379V12.2379Z" fill="white"/>
                                </svg>


                            </Picture>

                            <TextBlock>
                                <Name>
                                    Apple.com
                                </Name>

                                <Time>
                                    14:53, 11.01.21
                                </Time>
                            </TextBlock>
                        </TransactionFIRM>

                        <Person>
                            <IcoPerson>
                                <svg width="25" height="24" viewBox="0 0 25 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <circle cx="12.7974" cy="12" r="12" fill="#0057FF" fill-opacity="0.1"/>
                                    <path d="M12.5472 6.16602C9.38495 6.16602 6.71387 8.8371 6.71387 11.9993C6.71387 15.1616 9.38495 17.8327 12.5472 17.8327C15.7095 17.8327 18.3805 15.1616 18.3805 11.9993C18.3805 8.8371 15.7095 6.16602 12.5472 6.16602ZM12.5472 9.08268C13.5546 9.08268 14.2972 9.82468 14.2972 10.8327C14.2972 11.8407 13.5546 12.5827 12.5472 12.5827C11.5404 12.5827 10.7972 11.8407 10.7972 10.8327C10.7972 9.82468 11.5404 9.08268 12.5472 9.08268ZM9.5687 14.783C10.092 14.013 10.9646 13.4997 11.9639 13.4997H13.1305C14.1304 13.4997 15.0025 14.013 15.5257 14.783C14.7802 15.581 13.7226 16.0827 12.5472 16.0827C11.3718 16.0827 10.3142 15.581 9.5687 14.783Z" fill="#0057FF"/>
                                </svg>

                            </IcoPerson>

                            <Fio>
                                Иванов И. И.
                            </Fio>
                        </Person>

                        <Departament>
                            Отдел МАРКЕТИНГА
                        </Departament>

                        <Category>
                            ОБОРУДОВАНИЕ
                        </Category>

                        <Card>
                            <CardIco src={cardVisaImg}>
                            </CardIco>
                            <CardNumber>
                                *7640
                            </CardNumber>
                        </Card>

                        <Price>
                            <PriceValue>
                                {(89890).toLocaleString()}
                            </PriceValue>

                            <Currency>
                                RUB
                            </Currency>

                        </Price>

                    </TrItem>
                    <Divider/>

                </TransactionItems>

            </Block>


        </ContainerHistory>

    )
};

export default HistoryTransaction;